/*
	Программа по вычислению полиномов №33, №28 и произведения их результатов
	P(x) = -8980,032x^6 - 186,34x^4 - 649,23x^2 (полином №33)
	Q(x) = 9,09x^9 - 9,09x^3 + 9,09x (полином №28)
	Автор: Савин Павел Алексеевич, группа 2309. Версия 1.3.1
	Даты: Начало: 06.09.22 Окончание: 08.09.22
*/

#include <stdio.h>
#include <locale.h>

int main() {
	setlocale(LC_CTYPE, "Russian");
	double x, y, z, p1, p2, p3, q1, q2, q3;
	printf("%s", "Программа для работы с полиномами\nАвтор: Савин Павел\nПолиномы:\n1) -8980,032x^6 - 186,34x^4 - 649,23x^2\n2) 9,09x^9 - 9,09x^3 + 9,09x\nВведите x: ");
	scanf_s("%lf", &x);
	y = x * x, z = 9.09 * x;
	p1 = (-8980.032 * y) - 186.34;
	printf("%s %0.12lf\n", "1 шаг: ", p1);
	p2 = (p1 * y) - 649.23;
	printf("%s %0.12lf\n", "2 шаг: ", p2);
	p3 = p2 * y;
	printf("%s %0.7lf %s %0.12lf\n", "3 шаг и итоговое значение первого полинома при x = ", x, ": ", p3);
	q1 = (y * y * y) - 1;
	printf("%s %0.12lf\n", "1 шаг: ", q1);
	q2 = (q1 * y) + 1;
	printf("%s %0.12lf\n", "2 шаг: ", q2);
	q3 = q2 * z;
	printf("%s %0.7lf %s %0.12lf\n", "3 шаг и итоговое значение второго полинома при x = ", x, ": ", q3);
	printf("%s %0.12lf\n", "Произведение значений двух полиномов: ", p3 * q3);
	return 0;
}